1. Создайте две boolean переменные isWeekend и isRain. Создайте переменную canWalk, значение которой должно быть истинным, если это выходной день (isWeekend=true) и не идет дождь (isRain=false).

package lesson5.hw110523;

public class Homework51 {

    public static void main(String[] args) {

        boolean isWeekend = true;
        boolean isRain = false;

        boolean canWaalk = isWeekend && !isRain;

        System.out.println(canWaalk);
    }
}


2.Создайте две boolean переменные isEdekaOpen и isReweOpen, значения которых зависят от того, открыты магазины или нет. Напишите метод canBuy, принимающий в качестве параметров две этих переменных и возвращающий true, если хотя бы один магазин открыт, иначе false. Отобразите строку «Я могу купить еду: » и значение. Например, «Я могу купить еду: false»

package lesson5.hw110523;

public class Homework52 {

    public static void main(String[] args) {

        boolean isEdekaOpen = false;
        boolean isReweOpen = true;

        boolean canBay = isEdekaOpen || isReweOpen;

        System.out.println("Я могу купить еду: " + canBay);
    }
}


3.Представим, что у нас есть устройство, в котором две колбы. Прибор работает корректно, если температура первой колбы выше 100 градусов, а температура второй колбы меньше 100 градусов. Вы должны написать метод, который проверяет это устройство. Ваша программа должна иметь переменные temperature1 и temperature2. Метод принимает на вход две эти переменные и выводит в консоль true или false.

package lesson5.hw110523;

public class Homework53 {

    public static void main(String[] args) {

        int temperature1 = 101;
        int temperature2 = 69;

        System.out.println(temperature1 > 100 && temperature2 <100);
    }
}


4.Повышенной сложности
Есть устройство, на табло которого показывается количество секунд, оставшихся до конца рабочего дня. Когда рабочий день начинается ровно в 9 часов утра — табло отображает «28800» (т.е. остаётся 8 часов), когда 14:30 — на табло «9000» (т.е. остаётся два с половиной часа), а когда наступает 17 часов — на табло отображается «0» (т.е. рабочий день закончился).
Некоторый сотрудники не умеют оценивать остаток рабочего дня в секундах. 
Итак: требуется написать программу, которая вместо секунд будет выводить на табло понятные фразы с информацией о том, сколько полных часов осталось до конца рабочего дня. 
Например: «осталось 7 часов», «осталось 4 часа», «остался 1 час», «осталось менее часа».
Обьяснение: в переменную n должно записываться случайное (на время тестирования программы) целое число из диапазона от 0 до 28800, далее оно должно выводиться на экран (для тех, кто понимает в секундах) и на следующей строке (для тех кто не понимает) должна выводиться фраза о количестве полных часов, содержащихся в n секундах.

package lesson5.hw110523;

import java.util.Random;

public class Homework54 {

    public static void main(String[] args) {

        Random random = new Random();
        int n = random.nextInt(28801); // Генерация случайного числа от 0 до 28800
        int hours = n / 3600; // Перевод в полные часы

        System.out.println("Осталось: " + n + " секунд"); // Вывод значения в секундах

        // Вывод фразы о количестве полных часов
        if (hours < 1){
            System.out.println("Осталось менее часа");
            }else {
            System.out.println("Осталось: " + hours + " часа");
        }
    }
}
